---
kind: type
id: T:Autodesk.Revit.DB.PathType
source: html/dab91714-40d3-bc4a-6c5e-1b5eb504e341.htm
---
# Autodesk.Revit.DB.PathType

Enum determining what kind of path a given external file
 reference path is.
 Paths are valid for all types of external file references
 unless otherwise specified.

## Syntax (C#)
```csharp
public enum PathType
```